In [1]:
import numpy as np
import pandas as pd

In [5]:
data = {'Country': ['USA', 'UEA', 'KSA', 'UZB', 'ALASKA'],
        'Population (millions)': [50, 80, 120, 299, 100],
        'GDP (billion USD)': [500, 700, 900, 887, 1000],
        'Area (thousand sq km)': [200, 300, 400, 500, 700],
        'Happiness Index': [7.2, 6.5, 8.0, 9.0, 6.0]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

,Country,Population (millions),GDP (billion USD),Area (thousand sq km),Happiness Index
0,USA,50,500,200,7.2
1,UEA,80,700,300,6.5
2,KSA,120,900,400,8.0
3,UZB,299,887,500,9.0
4,ALASKA,100,1000,700,6.0

In [8]:
df['Country']

0       USA
1       UEA
2       KSA
3       UZB
4    ALASKA
Name: Country, dtype: object

In [9]:
df[['Country']]

  Country
0     USA
1     UEA
2     KSA
3     UZB
4  ALASKA

In [11]:
df['Country'].to_numpy()

array(['USA', 'UEA', 'KSA', 'UZB', 'ALASKA'], dtype=object)

In [12]:
df[['Country']].to_numpy()

array([['USA'],
       ['UEA'],
       ['KSA'],
       ['UZB'],
       ['ALASKA']], dtype=object)

In [13]:
df[['Population (millions)',   'GDP (billion USD)']]

   Population (millions)  GDP (billion USD)
0                     50                500
1                     80                700
2                    120                900
3                    299                887
4                    100               1000

In [14]:
df[3:]

,Country,Population (millions),GDP (billion USD),Area (thousand sq km),Happiness Index
3,UZB,299,887,500,9.0
4,ALASKA,100,1000,700,6.0

In [30]:
df = df.set_index('Country')

In [31]:
df

,Population (millions),GDP (billion USD),Area (thousand sq km),Happiness Index
Country,,,,
USA,50,500,200,7.2
UEA,80,700,300,6.5
KSA,120,900,400,8.0
UZB,299,887,500,9.0
ALASKA,100,1000,700,6.0

In [38]:
df = df.T

In [39]:
df[df>500]

Country                USA    UEA    KSA    UZB  ALASKA
Population (millions)  NaN    NaN    NaN    NaN     NaN
GDP (billion USD)      NaN  700.0  900.0  887.0  1000.0
Area (thousand sq km)  NaN    NaN    NaN    NaN   700.0
Happiness Index        NaN    NaN    NaN    NaN     NaN

In [40]:
df2 = df.transpose(copy=True)

In [41]:
df2

,Population (millions),GDP (billion USD),Area (thousand sq km),Happiness Index
Country,,,,
USA,50.0,500.0,200.0,7.2
UEA,80.0,700.0,300.0,6.5
KSA,120.0,900.0,400.0,8.0
UZB,299.0,887.0,500.0,9.0
ALASKA,100.0,1000.0,700.0,6.0

In [43]:
df2[df2['GDP (billion USD)']>900]

,Population (millions),GDP (billion USD),Area (thousand sq km),Happiness Index
Country,,,,
ALASKA,100.0,1000.0,700.0,6.0